Repository: IrinaMuravyova/CalorieCalculation
Catalog: *.lproj/Localizable.strings
Languages: ru, zh_hans

source: Weight loss
ru: Снижение веса
zh_hans: 减肥

# IM_role
source: IOS Developer
ru: IOS разработчик
zh_hans: IOS开发人员

# IM_name
source: Irina
ru: Ирина
zh_hans: 伊丽娜

# IM_surname
source: Muravyova
ru: Муравьёва

# user_exist
source: Nickname already exists.
ru: Этот пользователь уже существует.
zh_hans: 昵称已经存在。

# title_for_parameters_label
source: Please fill in the fields:
ru: Добавим подробностей:
zh_hans: 请填写这些字段:

# edit_title
source: Edit
ru: Правка
zh_hans: 编辑

# sex_alert
source: Specify the female or male gender by birth.
ru: Нужно указать пол: женский или мужской
zh_hans: 指定女性或男性性别

# age_alert
source: Specify how old you are (years). The Benedict-Harris formula works best for people between the ages of 18 and 80. For older people or for children, it is recommended to use other methods for more accurate calculations.
ru: Нужно указать свой возраст в годах. Формула Бенедикта-Харриса лучше всего работает для людей в возрасте от 18 до 80 лет. Для более старших людей или для детей рекомендуется использовать другие методы для более точных расчётов.
zh_hans: 指定您的年龄（年）。本尼迪克特-哈里斯公式最适合18至80岁的人。 对于老年人或儿童，建议使用其他方法进行更准确的计算。

# height_alert
source: Specify your height (centimeters). In general, the formula is suitable for people between 140-200 cm tall, but in extreme cases, for example, with extreme obesity or malnutrition, the results may be inaccurate.
ru: Нужно указать свой рост в сантиметрах. В общем случае формула подходит для людей ростом в пределах 140–200 см, но в крайних случаях, например, при экстремальном ожирении или недоедании, результаты могут быть неточными.
zh_hans: 指定你的身高（厘米）。一般来说，该配方适用于身高在140-200厘米之间的人，但在极端情况下，例如患有极度肥胖或营养不良，结果可能不准确。

# weight_alert
source: Specify your weight (kilograms). In general, the formula is suitable for people with a body weight in the range of 50-150 kg, but in extreme cases, for example, with extreme obesity or malnutrition, the results may be inaccurate.
ru: Нужно указать свой вес в килограммах. В общем случае формула подходит для людей с массой тела в пределах 50–150 кг, но в крайних случаях, например, при экстремальном ожирении или недоедании, результаты могут быть неточными.
zh_hans: 指定你的体重（公斤）。一般来说，该配方适用于体重在50-150kg范围内的人，但在极端情况下，例如，患有极度肥胖或营养不良，结果可能不准确。

# activity_alert
source: Choose how active you are usually.
ru: Нужно указать уровень активности
zh_hans: 选择你通常有多活跃。

# goal_alert
source: Choose your goal.
ru: Нужно указать свою цель
zh_hans: 选择你的目标。

# parameters_title
source: My settings:
ru: Мои параметры:
zh_hans: 我的设置:

# error_title_alert
source: Ooops!
ru: Упс!
zh_hans: 错误

# help_label
source: The Harris-Benedict formula, the most popular worldwide, is used to calculate the level of basal metabolism and determine the necessary calories. The formula was derived by American physiologist Francis Gano Benedict and botanist James Arthur Harris at the beginning of the last century, but still remains relevant. It has a margin of error of only about 5%. To calculate the calorie intake for weight loss, a calorie deficit of 20% is used with an adjustment of the proportions of proteins, fats and carbohydrates. And for weight gain, respectively, a calorie surplus of 20% with an adjustment in the proportions of proteins, fats and carbohydrates. It is also worth considering that the formula assumes use for adults from 18 to 80 years old, with a height of 140-200 cm, and a weight of 50 to 150 kg.
ru: Для расчета уровня базального метаболизма и определения необходимого калоража используется самая популярная во всем мире формула Харриса-Бенедикта. Формула была выведена американским физиологом Фрэнсисом Гано Бенедиктом и ботаником Джеймсом Артуром Харрисом еще в начале прошлого века, но до сих пор остается актуальной. Имеет погрешность всего около 5%. Для расчета калоража при похудении используется дефицит калорий в размере 20% с корректировкой пропорций белков, жиров и углеводов. А для набора массы, соответственно, профицит калорий в размере 20% с корректировкой пропорций белков, жиров и углеводов.
zh_hans: Harris-Benedict公式是全球最受欢迎的公式，用于计算基础代谢水平并确定必要的卡路里 该公式是由美国生理学家弗朗西斯*加诺*本尼迪克特和植物学家詹姆斯*亚瑟*哈里斯在上个世纪初推导出来的，但仍然具有相关性。 它的误差范围只有5%左右. 为了计算减肥的卡路里摄入量，使用20％的卡路里赤字来调整蛋白质，脂肪和碳水化合物的比例。 而对于体重增加，分别为20％的卡路里过剩，调整蛋白质，脂肪和碳水化合物的比例。 同样值得考虑的是，该配方适用于18至80岁的成年人，身高为140-200厘米，体重为50至150公斤。

# mail_title
source: Feedback about the app
ru: Обратная связь о приложении
zh_hans: 关于应用程序的反馈

# mail_message
source: Hello! I would like to inform you the following:
ru: Здравствуйте! Хотелось бы сообщить следующее:
zh_hans: 你好！ 我想告诉你以下几点:

# mail_error
source: The email client is not configured on the device.
ru: На устройстве не настроен почтовый клиент.
zh_hans: 设备上未配置电子邮件客户端。

# section_title
source: PROFILES
ru: ПОЛЬЗОВАТЕЛИ
zh_hans: 用户

# footer_text
source: Swipe to the left to delete or change the profile.
ru: Свайп влево для удаления или изменения профиля.
zh_hans: 向左滑动以删除或更改用户。

# delete_title
source: Delete
ru: Удалить
zh_hans: 删除

# edit_title_menu
source: Edit
ru: Редактировать
zh_hans: 编辑

# email_to_developer_title
source: WRITE TO THE DEVELOPER
ru: НАПИСАТЬ РАЗРАБОТЧИКУ
zh_hans: 写信给开发人员

# about_us_title
source: ABOUT US
ru: О НАС
zh_hans: 关于我们

# sex_title_label
source: Gender by birth
ru: пол
zh_hans: 性别

# age_title_label
source: Age, years
ru: Возраст, лет
zh_hans: 年龄 (年)

# height_title_label
source: Height, cm
ru: Рост, см
zh_hans: 身高 (厘米)

# weight_title_label
source: Weight, kg
ru: Вес, кг
zh_hans: 重量 (公斤)

# activity_title_label
source: Lifestyle
ru: Образ жизни
zh_hans: 生活方式

# goal_title_label
source: Goal
ru: Цель
zh_hans: 目标

# male_title_label
source: male
ru: мужской
zh_hans: 男

# female_title_label
source: female
ru: женский
zh_hans: 女

# result_title_label
source: My results
ru: Мой расчет
zh_hans: 我的结果

# day_norm_title_label
source: Daily norm:
ru: Суточная норма:
zh_hans: 每日规范:

# kcal_title_label
source: Kcal
ru: Ккал
zh_hans: 千卡

# protein_title_label
source: Protein
ru: Белки
zh_hans: 蛋白质

# fat_title_label
source: Fat
ru: Жиры
zh_hans: 脂肪

# carbs_title_label
source: Carbs
ru: Углеводы
zh_hans: 碳水化合物

# no_activity
source: <5000 steps, no training
ru: <5000 шагов, тренировки отсутствуют
zh_hans: <5000步，无需培训

# low_activity
source: 7-9 thousand steps + 2-3 workouts per week
ru: 7-9 тыс. шагов + 2-3 тренировки в неделю
zh_hans: 每周7-9千步+2-3次锻炼

# normal_activity
source: 10-15 thousand steps + 3-4 workouts per week
ru: 10-15 тыс. шагов + 3-4 тренировки в неделю
zh_hans: 每周10-15千步+3-4次锻炼

# high_activity
source: 5-7 workouts per week
ru: 5-7 тренировок в неделю
zh_hans: 每周5-7次训练

# extremal_activity
source: Workers of hard physical labor
ru: Работники тяжёлого физического труда
zh_hans: 艰苦体力劳动的工人

source: Muscle gain
ru: Набор мышечной массы
zh_hans: 肌肉增益

source: Maintenance
ru: Поддержание формы
zh_hans: 维护

source: Choose value
ru: Выбери значение...
zh_hans: 选择价值

# age_attention_title_alert
source: Attention
ru: Внимание!
zh_hans: 注意事项

# age_attention_text_alert
source: The formula assumes that it is applicable for adults (18 years and older). It is not recommended for children and adolescents to use it, since their metabolism has features different from adults. It is recommended to use other methods for more accurate calculations.
ru: Формула предполагает, что она применима для взрослых (от 18 лет и старше). Для детей и подростков её использовать не рекомендуется, так как их метаболизм имеет особенности, отличные от взрослых. Рекомендуется использовать другие методы для более точных расчётов.
zh_hans: 该公式假设它适用于成人（18岁及以上）。 不建议儿童和青少年使用它，因为它们的新陈代谢具有与成人不同的特征。 建议使用其他方法进行更精确的计算。

# delete_attention_title_alert
source: Oooops
ru: Не получится
zh_hans: 错误

# delete_attention_text_alert
source: You cannot delete the current profile. First, change the selected profile.
ru: Вы не можете удалить текущий аккаунт. Сначала смените текущий профиль.
zh_hans: 您无法删除当前帐户。 首先，更改所选帐户。

# sure_to_delete_title
source: Delete a line
ru: Удалить строку?
zh_hans: 删除一行？

# sure_to_delete_message
source: Are you sure you want to delete this line?
ru: Вы уверены, что хотите удалить эту строку?
zh_hans: 您确定要删除此行吗？

source: Cancel
ru: Отмена
zh_hans: 取消

source: Delete
ru: Удалить
zh_hans: 删除
